#include<stdio.h>

int main(){
int sum,p,x,y;
sum = 0;
for (x = 1,y = 1 ;x * y <= 15 ; x++ ,y += 2)
{
p = x * y ;
sum = sum + p;
printf("%d*%d = %d\n",x,y,p);
}
printf("summation of x * y = %d\n",sum);
return 0;
}

/* 
บรรทัดที่ 4 ประกาศตัวแปร sum,p,x,y
บรรทัดที่ 5 กำหนดค่า sum = 0
บรรทัดที่ 6 กำหนดค่า x = 1 ค่า y = 1 ลูปทำงานเมื่อ x * y <= 15 ค่า x เพิ่มขึ้นที่ละ 1 ค่า y เพิ่มขึ้นที่ละ 2
บรรทัดที่ 8 ค่าผลคูณของ x,y เก็บไว้ใน p
บรรทัดที่ 9 บวกค่า p เข้าไปในค่า sum
บรรทัดที่ 10 แสดงค่า x * y = p
บรรทัดที่ 12 แสดงผลค่าทั้งหมดที่คำนวณได้
บรรทัดที่ 13 จบการทำงานของโปรแกรม










*/